In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
os.chdir("D:\Jupyter Codes")

In [3]:
cars_data = pd.read_csv('toyota.csv', index_col = 0)

In [4]:
cars_data

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [5]:
cars_data1 = cars_data.copy(deep = True)

In [6]:
cars_data1.index

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
      dtype='int64', length=1436)

In [7]:
cars_data1.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [8]:
cars_data1.size

14360

In [9]:
cars_data1.shape

(1436, 10)

In [10]:
cars_data1.memory_usage()

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [11]:
cars_data1.ndim

2

In [12]:
cars_data1.head(6) #returns first n rows from the dataframe

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel  90       0.0          0  2000      3    1170
5  12950  32.0  61000   Diesel  90       0.0          0  2000      3    1170

In [13]:
cars_data1.tail(5)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [14]:
cars_data1.at[2,'FuelType']

'Diesel'

In [15]:
cars_data1.at[2,'KM']

'41711'

In [16]:
cars_data1.iat[2,4]

'90'

In [17]:
cars_data1.loc[:,'Doors']

0       three
1           3
2           3
3           3
4           3
        ...
1431        3
1432        3
1433        3
1434        3
1435        5
Name: Doors, Length: 1436, dtype: object

In [18]:
data = pd.read_csv('iris.csv')

In [19]:
data

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [20]:
cars_data1.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [21]:
cars_data1.dtypes.value_counts()

int64      4
object     4
float64    2
Name: count, dtype: int64

In [22]:
cars_data1.select_dtypes(exclude = [object])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [23]:
cars_data1.select_dtypes(exclude = 'int64')

       Age     KM FuelType   HP  MetColor  Doors
0     23.0  46986   Diesel   90       1.0  three
1     23.0  72937   Diesel   90       1.0      3
2     24.0  41711   Diesel   90       NaN      3
3     26.0  48000   Diesel   90       0.0      3
4     30.0  38500   Diesel   90       0.0      3
...    ...    ...      ...  ...       ...    ...
1431   NaN  20544   Petrol   86       1.0      3
1432  72.0     ??   Petrol   86       0.0      3
1433   NaN  17016   Petrol   86       0.0      3
1434  70.0     ??      NaN   86       1.0      3
1435  76.0      1   Petrol  110       0.0      5

[1436 rows x 6 columns]

In [24]:
cars_data1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 155.7+ KB

In [25]:
np.unique(cars_data1['MetColor'])

array([ 0.,  1., nan])

In [26]:
cars_data2 = pd.read_csv('toyota.csv', index_col = 0, na_values = ["??", "????"])

In [27]:
cars_data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [28]:
cars_data2['MetColor'] = cars_data2['MetColor'].astype('object')

In [29]:
cars_data2['Automatic'] = cars_data2['Automatic'].astype('object')

In [30]:
cars_data2['FuelType'].nbytes

11488

In [31]:
cars_data2['FuelType'].astype('category').nbytes

1460

In [32]:
cars_data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

In [33]:
np.unique(cars_data2['Doors'])

array(['2', '3', '4', '5', 'five', 'four', 'three'], dtype=object)

In [34]:
number_mapping = {
    'three': 3,
    'four': 4,
    'five': 5
}

In [35]:
cars_data2['Doors'] = cars_data2['Doors'].replace(number_mapping)

In [36]:
cars_data2['Doors'] = cars_data2['Doors'].astype(int)

In [37]:
np.unique(cars_data2['Doors'])

array([2, 3, 4, 5])

In [38]:
cars_data2.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [39]:
cars_data2.insert(10, "Price_Class", "")

In [40]:
cars_data2.loc[cars_data2['Price'] <= 8450, 'Price_Class'] = "Low"
cars_data2.loc[(cars_data2['Price'] > 8450) & (cars_data2['Price'] <= 11950), 'Price_Class'] = "Medium"
cars_data2.loc[cars_data2['Price'] > 11950, 'Price_Class'] = "High"

In [41]:
cars_data2['Price_Class'].value_counts()

Price_Class
Medium    751
Low       369
High      316
Name: count, dtype: int64

In [42]:
cars_data2.insert(11, "Age_Converted", 0)

In [43]:
def c_convert(val1, val2):
    val_converted = val1 / 12
    ratio = val2 / val1
    return [val_converted, ratio]

In [44]:
cars_data2['Age_Converted'].value_counts()

Age_Converted
0    1436
Name: count, dtype: int64

In [45]:
cars_data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Price          1436 non-null   int64
 1   Age            1336 non-null   float64
 2   KM             1421 non-null   float64
 3   FuelType       1336 non-null   object
 4   HP             1430 non-null   float64
 5   MetColor       1286 non-null   object
 6   Automatic      1436 non-null   object
 7   CC             1436 non-null   int64
 8   Doors          1436 non-null   int32
 9   Weight         1436 non-null   int64
 10  Price_Class    1436 non-null   object
 11  Age_Converted  1436 non-null   int64
dtypes: float64(3), int32(1), int64(4), object(4)
memory usage: 140.2+ KB

In [46]:
cars_data2.insert(12, "KM_per_month", 0)

In [47]:
cars_data2["Age_Converted"], cars_data2["KM_per_month"] = c_convert(cars_data2["Age"], cars_data2["KM"])
cars_data2["Age_Converted"] = round(cars_data2["Age_Converted"], 1)

In [48]:
cars_data2.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class,Age_Converted,KM_per_month
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.9,2042.869565
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.9,3171.173913
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,2.0,1737.958333
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,2.2,1846.153846
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,2.5,1283.333333